_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_1 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, None, 64)          0         
_________________________________________________________________
dense_1 (Dense)              (None, None, 32)          2080      
_________________________________________________________________
dropout_2 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_2 (Dense)              (None, None, 8)           264       
_________________________________________________________________
dropout_3 (Dropout)          (None, None, 8)           0         
_________________________________________________________________
dense_3 (Dense)              (None, None, 4)           36        
_________________________________________________________________
dropout_4 (Dropout)          (None, None, 4)           0         
_________________________________________________________________
dense_4 (Dense)              (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 9.49072551727295
dense layers: [32, 8, 4]
 activations: ['relu', 'relu', 'relu']
 optimizer: <keras.optimizers.SGD object at 0x7f349a082be0> 
 Final validation accuracy: 
0.7744274606880442
 *************************************************** 
 
Test accuracy : 0.7737236327587157
Testing duration (s) : 0.7385008335113525
Classification Report
             precision    recall  f1-score   support

        0.0    0.74042   0.84383   0.78875     18179
        1.0    0.81797   0.70345   0.75640     18135

avg / total    0.77915   0.77372   0.77259     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [15340  2839]
1   [ 5378 12757]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_2 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_2 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_5 (Dropout)          (None, None, 64)          0         
_________________________________________________________________
dense_5 (Dense)              (None, None, 32)          2080      
_________________________________________________________________
dropout_6 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_6 (Dense)              (None, None, 8)           264       
_________________________________________________________________
dropout_7 (Dropout)          (None, None, 8)           0         
_________________________________________________________________
dense_7 (Dense)              (None, None, 4)           36        
_________________________________________________________________
dropout_8 (Dropout)          (None, None, 4)           0         
_________________________________________________________________
dense_8 (Dense)              (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 10.135106801986694
dense layers: [32, 8, 4]
 activations: ['relu', 'relu', 'relu']
 optimizer: rmsprop 
 Final validation accuracy: 
0.8406535348960491
 *************************************************** 
 
Test accuracy : 0.8384094288704081
Testing duration (s) : 0.7729740142822266
Classification Report
             precision    recall  f1-score   support

        0.0    0.82250   0.86358   0.84254     18179
        1.0    0.85604   0.81318   0.83406     18135

avg / total    0.83925   0.83841   0.83830     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [15699  2480]
1   [ 3388 14747]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_3 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_3 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_9 (Dropout)          (None, None, 64)          0         
_________________________________________________________________
dense_9 (Dense)              (None, None, 32)          2080      
_________________________________________________________________
dropout_10 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_10 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_11 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_11 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_12 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_12 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 11.11523151397705
dense layers: [32, 8, 4]
 activations: ['relu', 'relu', 'relu']
 optimizer: adam 
 Final validation accuracy: 
0.8401257463530963
 *************************************************** 
 
Test accuracy : 0.837913752271851
Testing duration (s) : 0.7737264633178711
Classification Report
             precision    recall  f1-score   support

        0.0    0.81512   0.87458   0.84381     18179
        1.0    0.86436   0.80116   0.83156     18135

avg / total    0.83971   0.83791   0.83769     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [15899  2280]
1   [ 3606 14529]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_4 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_4 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_13 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_13 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_14 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_14 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_15 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_15 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_16 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_16 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 10.557061433792114
dense layers: [32, 8, 4]
 activations: ['relu', 'relu', 'sigmoid']
 optimizer: <keras.optimizers.SGD object at 0x7f349a082550> 
 Final validation accuracy: 
0.7353481126619986
 *************************************************** 
 
Test accuracy : 0.7358043729691028
Testing duration (s) : 0.8248300552368164
Classification Report
             precision    recall  f1-score   support

        0.0    0.71357   0.78893   0.74936     18179
        1.0    0.76337   0.68255   0.72070     18135

avg / total    0.73844   0.73580   0.73505     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [14342  3837]
1   [ 5757 12378]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_5 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_5 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_17 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_17 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_18 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_18 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_19 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_19 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_20 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_20 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 10.611443281173706
dense layers: [32, 8, 4]
 activations: ['relu', 'relu', 'sigmoid']
 optimizer: rmsprop 
 Final validation accuracy: 
0.8421910074705966
 *************************************************** 
 
Test accuracy : 0.8384094288704081
Testing duration (s) : 0.8807723522186279
Classification Report
             precision    recall  f1-score   support

        0.0    0.80745   0.88927   0.84639     18179
        1.0    0.87645   0.78743   0.82956     18135

avg / total    0.84191   0.83841   0.83798     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16166  2013]
1   [ 3855 14280]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_6 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_6 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_21 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_21 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_22 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_22 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_23 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_23 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_24 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_24 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 11.656098365783691
dense layers: [32, 8, 4]
 activations: ['relu', 'relu', 'sigmoid']
 optimizer: adam 
 Final validation accuracy: 
0.8205287023914419
 *************************************************** 
 
Test accuracy : 0.8187200528721705
Testing duration (s) : 0.9141383171081543
Classification Report
             precision    recall  f1-score   support

        0.0    0.75794   0.93718   0.83808     18179
        1.0    0.91746   0.69997   0.79409     18135

avg / total    0.83760   0.81872   0.81612     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [17037  1142]
1   [ 5441 12694]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_7 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_7 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_25 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_25 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_26 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_26 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_27 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_27 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_28 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_28 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 10.686845302581787
dense layers: [32, 8, 4]
 activations: ['tanh', 'tanh', 'relu']
 optimizer: <keras.optimizers.SGD object at 0x7f349a082be0> 
 Final validation accuracy: 
0.7787645114032238
 *************************************************** 
 
Test accuracy : 0.7732554937489673
Testing duration (s) : 0.9452598094940186
Classification Report
             precision    recall  f1-score   support

        0.0    0.78155   0.75928   0.77026     18179
        1.0    0.76540   0.78726   0.77618     18135

avg / total    0.77349   0.77326   0.77321     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [13803  4376]
1   [ 3858 14277]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_8 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_8 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_8 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_29 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_29 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_30 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_30 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_31 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_31 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_32 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_32 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 11.142505884170532
dense layers: [32, 8, 4]
 activations: ['tanh', 'tanh', 'relu']
 optimizer: rmsprop 
 Final validation accuracy: 
0.8311762769705137
 *************************************************** 
 
Test accuracy : 0.8289089607313984
Testing duration (s) : 0.9175112247467041
Classification Report
             precision    recall  f1-score   support

        0.0    0.80563   0.86754   0.83544     18179
        1.0    0.85614   0.79018   0.82184     18135

avg / total    0.83085   0.82891   0.82865     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [15771  2408]
1   [ 3805 14330]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_9 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_9 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_9 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dropout_33 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_33 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_34 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_34 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_35 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_35 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_36 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_36 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 17,041
Trainable params: 17,041
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 11.39014220237732
dense layers: [32, 8, 4]
 activations: ['tanh', 'tanh', 'relu']
 optimizer: adam 
 Final validation accuracy: 
0.8158933347950807
 *************************************************** 
 
Test accuracy : 0.813790824475409
Testing duration (s) : 0.9578602313995361
Classification Report
             precision    recall  f1-score   support

        0.0    0.75303   0.93454   0.83402     18179
        1.0    0.91347   0.69275   0.78795     18135

avg / total    0.83315   0.81379   0.81101     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16989  1190]
1   [ 5572 12563]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_10 (Conv1D)           (None, None, 64)          14656     
_________________________________________________________________
activation_10 (Activation)   (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_10 (MaxPooling (None, None, 64)          0         
_________________________________________________________________
dropout_37 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_37 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_38 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_38 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_39 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_39 (Dense)             (None, None, 1)           9         
=================================================================
Total params: 17,009
Trainable params: 17,009
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 10.242913961410522
dense layers: [32, 8]
 activations: ['relu', 'relu', 'relu']
 optimizer: <keras.optimizers.SGD object at 0x7f349a082550> 
 Final validation accuracy: 
0.8001514480869977
 *************************************************** 
 
Test accuracy : 0.7985074626865671
Testing duration (s) : 0.9270496368408203
Classification Report
             precision    recall  f1-score   support

        0.0    0.73745   0.92783   0.82176     18179
        1.0    0.90240   0.66887   0.76828     18135

avg / total    0.81982   0.79851   0.79505     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16867  1312]
1   [ 6005 12130]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_11 (Conv1D)           (None, None, 64)          14656     
_________________________________________________________________
activation_11 (Activation)   (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_11 (MaxPooling (None, None, 64)          0         
_________________________________________________________________
dropout_40 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_40 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_41 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_41 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_42 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_42 (Dense)             (None, None, 1)           9         
=================================================================
Total params: 17,009
Trainable params: 17,009
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 10.491364002227783
dense layers: [32, 8]
 activations: ['relu', 'relu', 'relu']
 optimizer: rmsprop 
 Final validation accuracy: 
0.8425811133710124
 *************************************************** 
 
Test accuracy : 0.8415487139946026
Testing duration (s) : 0.9380080699920654
Classification Report
             precision    recall  f1-score   support

        0.0    0.80824   0.89609   0.84990     18179
        1.0    0.88310   0.78688   0.83222     18135

avg / total    0.84562   0.84155   0.84107     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16290  1889]
1   [ 3865 14270]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_12 (Conv1D)           (None, None, 64)          14656     
_________________________________________________________________
activation_12 (Activation)   (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_12 (MaxPooling (None, None, 64)          0         
_________________________________________________________________
dropout_43 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_43 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_44 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_44 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_45 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_45 (Dense)             (None, None, 1)           9         
=================================================================
Total params: 17,009
Trainable params: 17,009
Non-trainable params: 0
_________________________________________________________________

Training duration (s) : 11.06243348121643
dense layers: [32, 8]
 activations: ['relu', 'relu', 'relu']
 optimizer: adam 
 Final validation accuracy: 
0.8441185856938904
 *************************************************** 
 
Test accuracy : 0.8399515338436967
Testing duration (s) : 0.9846501350402832
Classification Report
             precision    recall  f1-score   support

        0.0    0.80820   0.89196   0.84802     18179
        1.0    0.87915   0.78781   0.83098     18135

avg / total    0.84363   0.83995   0.83951     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16215  1964]
1   [ 3848 14287]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_13 (Conv1D)           (None, None, 64)          14656     
_________________________________________________________________
activation_13 (Activation)   (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_13 (MaxPooling (None, None, 64)          0         
_________________________________________________________________
dropout_46 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_46 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_47 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_47 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_48 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_48 (Dense)             (None, None, 1)           9         
=================================================================
Total params: 17,009
Trainable params: 17,009
Non-trainable params: 0
_________________________________________________________________
