_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_1 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_1 (Dense)              (None, None, 64)          4160      
_________________________________________________________________
dropout_1 (Dropout)          (None, None, 64)          0         
_________________________________________________________________
dense_2 (Dense)              (None, None, 32)          2080      
_________________________________________________________________
dropout_2 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_3 (Dense)              (None, None, 32)          1056      
_________________________________________________________________
dropout_3 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_4 (Dense)              (None, None, 16)          528       
_________________________________________________________________
dropout_4 (Dropout)          (None, None, 16)          0         
_________________________________________________________________
dense_5 (Dense)              (None, None, 1)           17        
=================================================================
Total params: 22,497
Trainable params: 22,497
Non-trainable params: 0
_________________________________________________________________

dense layers: [64, 32, 32, 16]
 activations: ['relu', 'relu', 'relu']
 optimizer: adam 
Training duration (s) : 1643.6845469474792
 Final validation accuracy: 
0.8509798461324368
 *************************************************** 
 
Test accuracy : 0.8462576416808945
Testing duration (s) : 0.825324535369873
Classification Report
             precision    recall  f1-score   support

        0.0    0.82812   0.87436   0.85061     18179
        1.0    0.86659   0.81809   0.84164     18135

avg / total    0.84733   0.84626   0.84613     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [15895  2284]
1   [ 3299 14836]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_2 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_2 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_6 (Dense)              (None, None, 64)          4160      
_________________________________________________________________
dropout_5 (Dropout)          (None, None, 64)          0         
_________________________________________________________________
dense_7 (Dense)              (None, None, 32)          2080      
_________________________________________________________________
dropout_6 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_8 (Dense)              (None, None, 16)          528       
_________________________________________________________________
dropout_7 (Dropout)          (None, None, 16)          0         
_________________________________________________________________
dense_9 (Dense)              (None, None, 1)           17        
=================================================================
Total params: 21,441
Trainable params: 21,441
Non-trainable params: 0
_________________________________________________________________

dense layers: [64, 32, 16]
 activations: ['relu', 'relu', 'relu']
 optimizer: adam 
Training duration (s) : 1612.8949077129364
 Final validation accuracy: 
0.8500160573490545
 *************************************************** 
 
Test accuracy : 0.8456242771382938
Testing duration (s) : 0.7792665958404541
Classification Report
             precision    recall  f1-score   support

        0.0    0.83384   0.86374   0.84853     18179
        1.0    0.85832   0.82746   0.84261     18135

avg / total    0.84606   0.84562   0.84557     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [15702  2477]
1   [ 3129 15006]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_3 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_3 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_10 (Dense)             (None, None, 64)          4160      
_________________________________________________________________
dropout_8 (Dropout)          (None, None, 64)          0         
_________________________________________________________________
dense_11 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_9 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_12 (Dense)             (None, None, 8)           264       
_________________________________________________________________
dropout_10 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_13 (Dense)             (None, None, 1)           9         
=================================================================
Total params: 21,169
Trainable params: 21,169
Non-trainable params: 0
_________________________________________________________________

dense layers: [64, 32, 8]
 activations: ['relu', 'relu', 'relu']
 optimizer: adam 
Training duration (s) : 1669.9421479701996
 Final validation accuracy: 
0.8492128996885387
 *************************************************** 
 
Test accuracy : 0.8464779423913642
Testing duration (s) : 1.035616397857666
Classification Report
             precision    recall  f1-score   support

        0.0    0.81857   0.89075   0.85314     18179
        1.0    0.87987   0.80210   0.83918     18135

avg / total    0.84918   0.84648   0.84617     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16193  1986]
1   [ 3589 14546]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_4 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_4 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_14 (Dense)             (None, None, 64)          4160      
_________________________________________________________________
dropout_11 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_15 (Dense)             (None, None, 16)          1040      
_________________________________________________________________
dropout_12 (Dropout)         (None, None, 16)          0         
_________________________________________________________________
dense_16 (Dense)             (None, None, 16)          272       
_________________________________________________________________
dropout_13 (Dropout)         (None, None, 16)          0         
_________________________________________________________________
dense_17 (Dense)             (None, None, 4)           68        
_________________________________________________________________
dropout_14 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_18 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 20,201
Trainable params: 20,201
Non-trainable params: 0
_________________________________________________________________

dense layers: [64, 16, 16, 4]
 activations: ['relu', 'relu', 'relu']
 optimizer: adam 
Training duration (s) : 1746.2548155784607
 Final validation accuracy: 
0.8493964782467595
 *************************************************** 
 
Test accuracy : 0.8460373409704246
Testing duration (s) : 0.8802192211151123
Classification Report
             precision    recall  f1-score   support

        0.0    0.81956   0.88795   0.85238     18179
        1.0    0.87742   0.80403   0.83912     18135

avg / total    0.84845   0.84604   0.84576     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16142  2037]
1   [ 3554 14581]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_5 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_5 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_19 (Dense)             (None, None, 64)          4160      
_________________________________________________________________
dropout_15 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
dense_20 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_16 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_21 (Dense)             (None, None, 16)          528       
_________________________________________________________________
dropout_17 (Dropout)         (None, None, 16)          0         
_________________________________________________________________
dense_22 (Dense)             (None, None, 8)           136       
_________________________________________________________________
dropout_18 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_23 (Dense)             (None, None, 8)           72        
_________________________________________________________________
dropout_19 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_24 (Dense)             (None, None, 1)           9         
=================================================================
Total params: 21,641
Trainable params: 21,641
Non-trainable params: 0
_________________________________________________________________

dense layers: [64, 32, 16, 8, 8]
 activations: ['relu', 'relu', 'relu']
 optimizer: adam 
Training duration (s) : 2173.1701657772064
 Final validation accuracy: 
0.8485015316873733
 *************************************************** 
 
Test accuracy : 0.8461474913256595
Testing duration (s) : 1.1731908321380615
Classification Report
             precision    recall  f1-score   support

        0.0    0.82132   0.88525   0.85209     18179
        1.0    0.87524   0.80695   0.83971     18135

avg / total    0.84825   0.84615   0.84591     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16093  2086]
1   [ 3501 14634]
 *************************************************** 
 

 Final test accuracies: [0.8462576416808945, 0.8456242771382938, 0.8464779423913642, 0.8460373409704246, 0.8461474913256595]