_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_1 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_1 (Dense)              (None, None, 32)          2080      
_________________________________________________________________
dropout_1 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_2 (Dense)              (None, None, 16)          528       
_________________________________________________________________
dropout_2 (Dropout)          (None, None, 16)          0         
_________________________________________________________________
dense_3 (Dense)              (None, None, 8)           136       
_________________________________________________________________
dropout_3 (Dropout)          (None, None, 8)           0         
_________________________________________________________________
dense_4 (Dense)              (None, None, 8)           72        
_________________________________________________________________
dropout_4 (Dropout)          (None, None, 8)           0         
_________________________________________________________________
dense_5 (Dense)              (None, None, 1)           9         
=================================================================
Total params: 17,481
Trainable params: 17,481
Non-trainable params: 0
_________________________________________________________________

dense layers: [32, 16, 8, 8]
 activations: ['relu', 'relu', 'sigmoid']
 optimizer: sgd_lr0001_dec1e6_m095 
Training duration (s) : 1449.1149835586548
 Final validation accuracy: 
0.8465739539427987
 *************************************************** 
 
Test accuracy : 0.8441923225202401
Testing duration (s) : 0.8137943744659424
Classification Report
             precision    recall  f1-score   support

        0.0    0.80576   0.90753   0.85362     18179
        1.0    0.89387   0.78070   0.83346     18135

avg / total    0.84976   0.84419   0.84355     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16498  1681]
1   [ 3977 14158]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_2 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_2 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_6 (Dense)              (None, None, 32)          2080      
_________________________________________________________________
dropout_5 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_7 (Dense)              (None, None, 16)          528       
_________________________________________________________________
dropout_6 (Dropout)          (None, None, 16)          0         
_________________________________________________________________
dense_8 (Dense)              (None, None, 8)           136       
_________________________________________________________________
dropout_7 (Dropout)          (None, None, 8)           0         
_________________________________________________________________
dense_9 (Dense)              (None, None, 8)           72        
_________________________________________________________________
dropout_8 (Dropout)          (None, None, 8)           0         
_________________________________________________________________
dense_10 (Dense)             (None, None, 1)           9         
=================================================================
Total params: 17,481
Trainable params: 17,481
Non-trainable params: 0
_________________________________________________________________

dense layers: [32, 16, 8, 8]
 activations: ['relu', 'relu', 'sigmoid']
 optimizer: adam 
Training duration (s) : 1580.3854253292084
 Final validation accuracy: 
0.8457249024319307
 *************************************************** 
 
Test accuracy : 0.8441097097538139
Testing duration (s) : 0.8277597427368164
Classification Report
             precision    recall  f1-score   support

        0.0    0.80823   0.90280   0.85290     18179
        1.0    0.88962   0.78528   0.83420     18135

avg / total    0.84888   0.84411   0.84356     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16412  1767]
1   [ 3894 14241]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_3 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_3 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_11 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_9 (Dropout)          (None, None, 32)          0         
_________________________________________________________________
dense_12 (Dense)             (None, None, 32)          1056      
_________________________________________________________________
dropout_10 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_13 (Dense)             (None, None, 16)          528       
_________________________________________________________________
dropout_11 (Dropout)         (None, None, 16)          0         
_________________________________________________________________
dense_14 (Dense)             (None, None, 16)          272       
_________________________________________________________________
dropout_12 (Dropout)         (None, None, 16)          0         
_________________________________________________________________
dense_15 (Dense)             (None, None, 8)           136       
_________________________________________________________________
dropout_13 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_16 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_14 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_17 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 18,769
Trainable params: 18,769
Non-trainable params: 0
_________________________________________________________________

dense layers: [32, 32, 16, 16, 8, 4]
 activations: ['relu', 'relu', 'sigmoid']
 optimizer: sgd_lr0001_dec1e6_m095 
Training duration (s) : 1775.1982023715973
 Final validation accuracy: 
0.8509568992058929
 *************************************************** 
 
Test accuracy : 0.8481026601310789
Testing duration (s) : 1.1051642894744873
Classification Report
             precision    recall  f1-score   support

        0.0    0.83509   0.86798   0.85122     18179
        1.0    0.86222   0.82818   0.84486     18135

avg / total    0.84864   0.84810   0.84804     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [15779  2400]
1   [ 3116 15019]
 *************************************************** 
 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_4 (Conv1D)            (None, None, 64)          14656     
_________________________________________________________________
activation_4 (Activation)    (None, None, 64)          0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, None, 64)          0         
_________________________________________________________________
dense_18 (Dense)             (None, None, 32)          2080      
_________________________________________________________________
dropout_15 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_19 (Dense)             (None, None, 32)          1056      
_________________________________________________________________
dropout_16 (Dropout)         (None, None, 32)          0         
_________________________________________________________________
dense_20 (Dense)             (None, None, 16)          528       
_________________________________________________________________
dropout_17 (Dropout)         (None, None, 16)          0         
_________________________________________________________________
dense_21 (Dense)             (None, None, 16)          272       
_________________________________________________________________
dropout_18 (Dropout)         (None, None, 16)          0         
_________________________________________________________________
dense_22 (Dense)             (None, None, 8)           136       
_________________________________________________________________
dropout_19 (Dropout)         (None, None, 8)           0         
_________________________________________________________________
dense_23 (Dense)             (None, None, 4)           36        
_________________________________________________________________
dropout_20 (Dropout)         (None, None, 4)           0         
_________________________________________________________________
dense_24 (Dense)             (None, None, 1)           5         
=================================================================
Total params: 18,769
Trainable params: 18,769
Non-trainable params: 0
_________________________________________________________________

dense layers: [32, 32, 16, 16, 8, 4]
 activations: ['relu', 'relu', 'sigmoid']
 optimizer: adam 
Training duration (s) : 2043.751831293106
 Final validation accuracy: 
0.8425122704631317
 *************************************************** 
 
Test accuracy : 0.8414661012281764
Testing duration (s) : 1.016103744506836
Classification Report
             precision    recall  f1-score   support

        0.0    0.79930   0.91243   0.85212     18179
        1.0    0.89770   0.77033   0.82915     18135

avg / total    0.84844   0.84147   0.84065     36314

Confusion_matrix
true| predicted label
    |  0    1
0   [16587  1592]
1   [ 4165 13970]
 *************************************************** 
 

 Final test accuracies: [0.8441923225202401, 0.8441097097538139, 0.8481026601310789, 0.8414661012281764]